English/ielts/task2-prereading.org
#+OPTIONS: \n:t num:nil html-postamble:nil
* 习惯用法
* Reading to Learn the Art of Expression
When you read a short story, you may read it merely for pleasure.
When you read a biographical sketch, you may read it merely for information.
But as you are a learner of English, I think you should often read to learn the art of expression.
And for this purpose you may read either a short story or a biographical sketch,
	either an essay or a news item, indeed,
	anything that is written in good current English.

Even from a short paragraph you may learn several forms of expression
	if you are observant enough.
Try to read the following paragraphs from BBC Modern English
	and notice the points of usage listed below;

Over 100 years ago she opened the first British hospital for women.
There are still very few of these hospitals in England.
This hospital is in Euston Road in London.
Its situation means that women from all over England can reach it quite easily.

Her aim when she opened the hospital
	was to provide a place where women could go
		and receive treatment from female doctors and nurses.
She also wanted the hospital to provide jobs for female doctors at a time
	when it was very difficult for them to find work.
Recently the authorities have tried to close the hospital.
They say that it is old-fashioned and wastes a lot of money.
However, the Government has decided that the hospital wil1 stay open.
Many people feel very glad that the valuable service offered by this hospital will continue.
1. “Over” More than.
2. "in Euston Road" "in ... Road".
3. “means that ...” “Means” takes an object clause introduced by “that”.
4. “from all over Englend” “all over England” “from all over England”.
5. “receive treatment”. Patients receive treatment.
6. “wanted the hospital to provide ..."
   “We wont them to do it”.
7. “at a time when ...” “at a time when ..."
8. “Recently the authorities bave tried.” The present perfect is here used with “recently”.
9. “the Government has” “the Government" can be considered singular.
10. “decided that ...” “Decide(d)” takes an object clause introduced by “that”.
11. “stay open”. “Stay” can be a copulative verb.
In this way you wil1 learn the art of expression very quickly;
perhaps one or two paragraphsa day will teach you hundreds of forms of expression in a month,
	and these forms of expression will greatly improve your writing.
And if you can -- I believe you can -- commit to memory' one or two paragraphs a day
	that you have already read in this way, the results will be still greater;
** NOTES
1. BBC Modern English 英国杂志名。 (BBC = British Broudcasting Corporation)
2. commit to memory 把...牢记。
** 英语如何提升口语和写作?
英文阅读如何提升口语和写作?

作为一个英语学习者,在英语阅读的时候,不能单单为了娱乐或者获得信息.
可以在任意用当代英语的好文章,甚至是段落中,积累对应的词汇和习惯用法.
养成这个习惯后,每天学个两个段落,一个月就可以积攒不少词汇和习惯用法.
这些词汇和习惯用法积累多了,口语和写作也就有了素材,自然地口语和写作就会提升.
英文阅读就像树的主干,口语和写作就像是树叶.

** words
- biographical
	1. I'm looking forward to his biographical sketch.
	2. His biographical sketch could be found in the library.
	3. His biographical sketches have been sold out recently.
** grammar
- when ...
- as...
- may ...
- either ... or
- anything that ...
- if S. + 现在
- usage listed ...
- have done
	
** expression
- in ... Road
	1. There is an argument in West Lake Road yesterday.
	2. My wife always goes for a walk in Euston Road.
	3. There is a lot of excitement in West Lake Road.
- receive A from B
	1. I have not received any message from my wife since we argued yesterday.
	2. I can't bear that I have not received any message from my old classmate.
	3. I feel glad that I received a response from teacher Leo.
- want sb. to do
	1. Ross wanted Rachel to do him a favor.
	2. I'm sorry that Rachel does not want you to share the house with him.
	3. I want my boss to pay my salary instantly.
- waste money
	1. My wife is always wasting money.
	2. He complained that his wife had wasted money again in Beijing.
	3. They said that the hospital is old-fashioned and has wasted a lot of money.
- In this way
	1. In this way, you can prove your writing very quickly.
	2. I don't want you to be down to ride for me in this way.
	3. My wife refuses to accept my apologies in this way.
- two paragraphs a day
	1. Two paragraphs a day may help you improve your English in a month.
	2. Two paragraphs a day is difficult for him to read.
	3. Tow paragraphs a day is easy for him to write.
- hundreds of
	1. There are hundreds of ants eating the tree root in the desert.
	2. Hundreds of people go home by this train.
	3. There are hundreds of choices that you can choose.

** pattern
- I think you should
	1. I think you should be willing to assist your father.
	2. I think you should tell him the truth.
	3. I don't think you should give him the answer directly.
- at a time when ...
	1. She opened the hospital at a time when women is in low status.
	2. I provided a watch for my wife at a time when she was crying.
	3. I went to bed yesterday at a time when someone rang the bell.
- S. means that ...
	1. The situation means that you needn't finish your job.
	2. The sign means that he's going to propose to you.
	3. It means that we have wasted too much money.
- S. feels glad that ...
	1. Ross felt glad that Rachel still fell in love with him.
	2. I feel glad that you, my old friend, still remember me.
	3. I feel glad that my cat often winks at me.

** 疑惑
1. 全英字典看不懂怎么办?
2. 比较高效率的精读步骤顺序?
3. 除了阅读,口语和写作还差点什么?
